export interface Articles {
  id: string;
  slug: string;
  title: string;
  description: string;
  data: {
    header: string;
    subheader: string[];
    subimage: string[];
  }[];
  images: string[];
  keywords: string[];
  date: string;
  author: string;
  reference: string;
}

export const articles: Articles[] = [
  {
    id: "1",
    slug: "amateur-radio-license-training-exam-2025",
    title:
      "กำหนดการอบรมและสอบเพื่อรับประกาศนียบัตรพนักงานวิทยุสมัครเล่นขั้นต้น 2568",
    description:
      "ประกาศแล้ว สนามสอบเพื่อรับประกาศนียบัตรพนักงานวิทยุสมัครเล่นขั้นต้น ประจำปี 2568 ทั่วประเทศไทย ใกล้ที่ไหน ไปที่นั่น โดยจะแบ่งเป็น 2 แบบ คือ อบรมและสอบ และ สอบเพียงอย่างเดียว",
    data: [
      {
        header: "สนามสอบที่จัดอบรมและสอบ",
        subheader: [
          "22 กุมภาพันธ์ 2568 สมาคมวิทยุสมัครเล่นพัทลุง HS9AP",
          "15 มีนาคม 2568 สมาคมวิทยุสมัครเล่นนนทบุรี HS1AN",
          "29 มีนาคม 2568 สมาคมวิทยุสมัครเล่นขอนแก่น HS4AK",
          "26 เมษายน 2568 สมาคมวิทยุสมัครจังหวัดเล่นกระบี่ HS8AK",
          "14 มิถุนายน 2568 สมาคมวิทยุสมัครเล่นนครราชสีมา HS3AN",
          "19 กรกฎาคม 2568 สมาคมวิทยุสมัครเล่นสุพรรณบุรี HS7AS",
          "16 สิงหาคม 2568 สมาคมวิทยุสมัครเล่นสุราษฎร์ธานี HS8AS",
          "18 ตุลาคม 2568 สมาคมวิทยุอาสาสมัคร HS1AB กรุงเทพฯ",
          "22 พกศจิกายน 2568 สมาคมวิทยุสมัครเล่นฉะเชิงเทรา HS2AS",
        ],
        subimage: [""],
      },
      {
        header: "สนามสอบที่จัดสอบเพียงอย่างเดียว",
        subheader: [
          "24 พฤษภาคม 2568 สมาคมวิทยุอาสาสมัคร HS1AB กรุงเทพฯ",
          "13 กันยายน 2568 สมาคมวิทยุสมัครเล่นจังหวัดอุทัยธานี HS6AU",
          "8 พฤศจิกายน 2568 สมาคมวิทยุสมัครเล่นสุโขทัย HS6AS",
        ],
        subimage: [""],
      },
      {
        header: "สนใจสอบ",
        subheader: [
          "หากมีความสนใจและประสงค์เข้าร่วมอบรมและสอบหรือสอบอย่างเดียว สามารถติดต่อไปที่สมาคมที่ดูแลการสอบครั้งนั้น ๆ ได้เลยนะครับ"
        ],
        subimage: [""]
      }
    ],
    images: ["/images/amateur-radio-license-training-exam-2025-1.jpg"],
    keywords: [],
    date: "",
    author: "",
    reference:
      "https://www.nbtc.go.th/Business/commu/radio/licensing/%E0%B8%81%E0%B8%B2%E0%B8%A3%E0%B8%AA%E0%B8%AD%E0%B8%9A-%E0%B8%AD%E0%B8%9A%E0%B8%A3%E0%B8%A1%E0%B9%81%E0%B8%A5%E0%B8%B0%E0%B8%AA%E0%B8%AD%E0%B8%9A-%E0%B8%A7%E0%B8%B4%E0%B8%97%E0%B8%A2%E0%B8%B8%E0%B8%AA%E0%B8%A1%E0%B8%B1%E0%B8%84%E0%B8%A3%E0%B9%80%E0%B8%A5%E0%B9%88%E0%B8%99/%E0%B8%81%E0%B8%B3%E0%B8%AB%E0%B8%99%E0%B8%94%E0%B8%81%E0%B8%B2%E0%B8%A3%E0%B8%88%E0%B8%B1%E0%B8%94%E0%B8%AD%E0%B8%9A%E0%B8%A3%E0%B8%A1%E0%B9%81%E0%B8%A5%E0%B8%B0%E0%B8%AA%E0%B8%AD%E0%B8%9A%E0%B9%80%E0%B8%9E%E0%B8%B7%E0%B9%88%E0%B8%AD%E0%B8%A3%E0%B8%B1%E0%B8%9A%E0%B8%9B%E0%B8%A3%E0%B8%B0%E0%B8%81%E0%B8%B2%E0%B8%A8%E0%B8%99%E0%B8%B5%E0%B8%A2%E0%B8%9A%E0%B8%B1%E0%B8%95%E0%B8%A3%E0%B8%9E%E0%B8%99%E0%B8%B1%E0%B8%81%E0%B8%87%E0%B8%B2%E0%B8%99%E0%B8%A7/68377.aspx?lang=th-TH",
  },
  {
    id: "2",
    slug: "how-to-become-an-amateur-radio",
    title: "อยากเป็นพนักงานวิทยุสมัครเล่น ต้องเตรียมตัวอย่างไร?",
    description:
      "เริ่มต้นเส้นทางสู่การเป็นพนักงานวิทยุสมัครเล่น! บทความนี้จะแนะนำขั้นตอนการเตรียมตัว ตั้งแต่การศึกษาข้อกำหนดทางกฎหมาย การเรียนรู้ทฤษฎีและหลักปฏิบัติ การฝึกฝนทักษะการสื่อสาร ไปจนถึงการเตรียมตัวสอบเพื่อรับใบอนุญาต พร้อมแหล่งข้อมูลและเคล็ดลับที่จะช่วยให้คุณก้าวสู่โลกของวิทยุสมัครเล่นได้อย่างมั่นใจ ซึ่งวันนี้จะมาแนะนำขั้นตอนการเตรียมตัวเพื่อเป็นพนักงานวิทยุสมัครเล่นง่าย ๆ เพียง 6 ขั้นตอน",
    data: [
      {
        header: "1. ตรวจสอบกำหนดการจัดสอบหรือการจัดอบรม",
        subheader: [
          "ปกติสนามสอบก็เปิดให้สอบทั่วประเทศอยู่แล้ว ใกล้ที่ไหนก็ไปที่นั่นเพื่อความสะดวกในการเรียนรู้และสอบ",
        ],
        subimage: [""],
      },
      {
        header: "2. ยื่นใบสมัคร กสทช.หรือสมาคมวิทยุสมัครเล่นที่ดำเนินการ",
        subheader: [
          "เมื่อเลือกสนามสอบที่ต้องการได้แล้ว ให้ติดต่อ กสทช.หรือสมาคมวิทยุสมัครเล่นที่ดำเนินการ เพื่อยื่นใบสมัคร",
        ],
        subimage: [""],
      },
      {
        header: "3. ค้นคว้า หาความรู้ ทำแบบทดสอบ และเตรียมตัวสอบ",
        subheader: [
          "ในการทำแบบทดสอบ สามารถทำออนไลน์อยู่ที่บ้านได้ โดยทางเว็บไซต์ของ กสทช. มีแบบทดสอบออนไลน์ให้ทำทั้ง ขั้นต้น ขั้นกลางและขั้นสูง",
        ],
        subimage: [""],
      },
      {
        header: "4. เข้าสอบหรือเข้าอบรมแล้วสอบ ตามกำหนดการ",
        subheader: [
          "ศึกษาเส้นทางการเดินทางไปสนามสอบให้ดี และเตรียมตัวให้พร้อมสำหรับการสอบ",
        ],
        subimage: [""],
      },
      {
        header: "5. ตรวจสอบรายชื่อผู้ผ่านเกณฑ์การสอบ",
        subheader: [
          "สามารถตรวจสอบรายชื่อผู้ผ่านเกณฑ์การสอบได้ที่เว็บไซต์ของ กสทช. หรือสมาคมวิทยุสมัครเล่นที่ดำเนินการ",
        ],
        subimage: [""],
      },
      {
        header:
          "6. ติดต่อขอรับประกาศนียบัตรจาก กสทช. หรือสมาคมวิทยุสมัครเล่นที่ดำเนินการ",
        subheader: [
          "เมื่อผ่านการสอบและผ่านเกณฑ์การสอบ ให้ติดต่อขอรับประกาศนียบัตรจาก กสทช. หรือสมาคมวิทยุสมัครเล่นที่ดำเนินการ",
        ],
        subimage: [""],
      },
    ],
    images: [],
    keywords: [""],
    date: "",
    author: "",
    reference: "https://lib.nbtc.go.th/news/detail/544",
  },
  {
    id: "3",
    slug: "follow-hs6aj-more",
    title: "ช่องทางติดตามอื่น ๆ ของสมาคมวิทยุสมัครเล่นจังหวัดพิจิตร",
    description:
      "นอกจากเว็บไซต์สมาคมวิทยุสมัครเล่นจังหวัดพิจิตร HS6AJ นี้แล้ว ยังมีช่องทางอื่น ให้เพื่อน ๆ ได้ติดตามอีกนะครับ",
    data: [
      {
        header: "Facebook Fanpage",
        subheader: [
          "",
        ],
        subimage: [""],
      },
      {
        header: "Line Official Account",
        subheader: [
          "",
        ],
        subimage: [""],
      },
      {
        header: "ฝากกดติดตามเพื่อเป็นกำลังใจให้ด้วยนะครับ",
        subheader: [
          "",
        ],
        subimage: [""],
      },
    ],
    images: [],
    keywords: ["ติดตาม HS6AJ", "ทางช่องติดต่อ HS6AJ", "line hs6aj", "facebook hs6aj"],
    date: "",
    author: "HS6AJ",
    reference: "",
  },
];
